const zawen = [
  {
    id: "s001",
    title: "鱼香肉丝到底有没有🐟",
    icon: "/images/icon1.png",
    img: "/images/鱼香肉丝.jpg",
    content: "答案是没有....相传很久以前在四川有一户生意人家，他们家里的人很喜欢吃鱼，对调味也很讲究，所以他们在烧鱼的时候都要放一些葱、姜、蒜、酒、醋、酱油等去腥增味的调料。有一次晚上这个家中的女主人在炒另一只菜的时候，她为了不使配料浪费，她把上次烧鱼时用剩的配料都放在这款菜中炒和，当时她还以为这款菜可能味不是很好吃，可能家中的男人回来后不好交待，她正在发呆之际，她的老公做生意回家了。这个老公不知是肚饥之故还是感觉这碗菜的特别，而他还没等开饭就用手抓起就往嘴中咽，还没等一分钟，他迫不及待地问老婆此菜是用何做的，她刚在结结巴巴时，她意外地发现其老公连连称赞其菜之味，她老公见她没回答，又问了一句“怎么好吃是用什么做得”，就这样老婆才一五一十地给他讲了一遍。而这款菜是用烧鱼的配料来炒和其它菜肴，才会其味无穷，所以取名为鱼香炒，而得此名。"
  }, {
    id: "s002",
    title: "幸福耙耳朵",
    img: "/images/耙耳朵.jpg",
    icon: "/images/icon2.png",
    content: "“耙（pā）耳朵”为西南地区（四川、重庆、贵州、云南等地）独有的词汇，因男子结婚后常被老婆揪耳朵而形象地留传开，“耙耳朵”一词正是形容男子耳根软，怕老婆。于是四川电视台经济频道推出了一个方言情景喜剧《幸福耙耳朵》，里面将生活中哪些“耙耳朵”有好“耙”展现得淋漓尽致，一经播出就收获了众多男同胞得共鸣。凭借着幽默风趣的语言、搞笑生动的情节，并且紧贴百姓生活的热点话题，使得这部“接地气”的系列电视剧深受群众的欢迎和喜爱，几乎成为家家必看的电视节目。就我个人而言，我从小学几乎一直看到高中，每天写完作业之后便会蹲守在电视机旁等待开播，有些情节反复看了好几遍也不会觉得腻。由于其拍摄非常接地气，让每个四川人在观看的时候都能够感同身受，沉浸其中，实属佳品，大力推荐。"
  }, {
    id: "s003",
    title: "李伯清评书",
    img: "/images/李伯清.png",
    icon: "/images/icon3.png",
    content: "李伯清（1947年11月8日-），昵称李伯伯，出生于四川成都，中国民间男艺术家、评书人、主持人、国家一级演员，四川省曲艺家协会会员。以散打评书闻名，从上世纪90年代起，李伯清就以四川方言来讲述家长里短，新鲜生动又实事求是。其睿智幽默的“川味”方言作品，陪伴着巴蜀两地一代人的成长，李伯清也因此被不少人亦庄亦谐称为“巴蜀男神”。他的评书讲的都是接地气普通百姓身边的事情，欢笑后不忘告诉大家一些为人处世搞好婆媳关系夫妻关系的道理，这应该是他的散打评书最闪光的地方。类似于相声的演绎方式，只不过李伯清是一个人分饰两角，通过自己的描述，把故事生动形象地展示到我们的眼前，也值得一看。"
  }, {
    id: "s004",
    title: "谭谈交通",
    img: "/images/谭谈交通.jpg",
    icon: "/images/icon4.png",
    content: "提到谭谈交通，大多数人最先想到的都是那句经典名言“到二仙桥走成华大道”。一般来说，成都人民有两大男神，一个是李伯清，另一个是谭乔。李伯清是巴蜀笑星，散打评书鼻祖，谭乔只是一名普通交警。2005年到2018年，谭乔每天在成都电视台第三频道和大家见面，13年间，他主持了3000多期《谭谈交通》，一期节目六七分钟，谭乔和几千个违章的人聊过天。虽是交通节目，《谭谈交通》看起来更像一档民生节目，被谭乔拦下的人，有拉柴火的、养猪的、卖气球的，也有开豪车的，谭乔是那个最不像警察的警察，他一口椒盐普通话，没什么架子，和大家拉家常，掰手腕，有时甚至唱起自己改编的普法歌。我清晰地记得，有一期是一个政府部门的人员故意遮挡车牌号，谭乔一改往常的“老好人”形象，语气十分严肃认真，甚至上门去找了他们的领导谈话。因为谭乔了解底层贫苦人民的不易之处，所以态度更加温和，但对于政府人员知法犯法的现象又重拳出击，展现了谭sir站在人民群众的真实一面。"
  }, {
    id: "s005",
    title: "青城山下白素贞~",
    img: "/images/白素贞.jpg",
    icon: "/images/icon1.png",
    content: "“青城山下白素贞，洞中千年修此身”，提起青城山，很多人或许都能脱口而出这句经典歌词。这是一代又一代人的记忆，就算不知道青城山的，也因为这句歌曲牢记了这个地名。其实，之前我还有些许的疑惑，为什么白娘子在青城山修炼却要跑去杭州雷峰塔。后来查了资料后发现，青城山是她修炼的地方，修炼好了本来要成仙了，后来观音说她还没报恩，恩人（许仙）在杭州当医生，所以她要去杭州找恩人完成任务才能成仙，否则不能成仙。后来就是我们所熟悉的故事了，白素贞是千年修炼的蛇妖，为了报答书生许仙前世的救命之恩，化为人形欲报恩，后遇到青蛇精小青，两人结伴。白素贞施展法力，巧施妙计与许仙相识，并嫁与他。婚后金山寺和尚法海对许仙讲白素贞乃蛇妖，许仙将信将疑。后来许仙按法海的办法在端午节让白素贞喝下带有雄黄的酒，白素贞不得不显出原形，却将许仙吓死，白素贞上天庭盗取仙草将许仙救活。《白蛇传》也算是童年回忆之一了，所以十分推荐爬一爬青城山。"
  }, {
    id: "s006",
    title: "三星堆传说",
    img: "/images/三星堆传说.jpg",
    icon: "/images/icon2.png",
    content: "三星堆遗址是一处距今4800年至3100年左右的古蜀文化遗址，面积达12平方公里，是中国20世纪重大的考古发现之一。其地处四川省广汉市城西鸭子河畔，距成都38公里。三星堆的名字虽然带有某种“太空色彩”，但其来源并不稀奇，只是因为最早发现相关文物的地方有三个土堆，后来被称为“三星堆”。自20世纪20年代起至今，中外考古学家对其进行了大量的考古发掘和专题研究，发现了城墙遗址和大量精美文物。三星堆遗址及文物的发现，有力地证明了三四千年前古蜀国的存在和中华文明起源的多元性。三星堆博物馆位于德阳广汉市，来四川省旅游的话也可以作为一个考虑的去处。在参观的时候建议聘一个讲解员，不然的话只能是走马观花拍一堆照片但日后根本不会去翻..."
  }, {
    id: "s007",
    title: "中国最古老的中学",
    img: "/images/成都四中.png",
    icon: "/images/icon3.png",
    content: "石室中学，坐落于四川省成都市文庙前街93号的学校，人们普遍叫它成都四中。2022年11月11日，人们都在欢庆双十一的时候，是石室中学建校2163周年。根据史料记载，公元前141年，即西汉汉景帝末年，时任蜀郡太守的文翁深感蜀地偏远，文化落后，仍有蛮夷之风，便在成都南门修起学宫，招各县子弟入学，大兴教化，创办了中国历史上第一所地方官办学校，史称“石室精舍”。文翁还从郡县吏中挑选“开敏有材者”前往长安学习，待其学成归来后委以官职担任讲学任务。这座房子所在之地，就是现在的成都石室中学。2163年以来，虽校名多次更改，但校址从未变动。被称为“全国最古老、历史最悠久的中学”。"
  }, {
    id: "s008",
    title: "四川话的发展",
    img: "/images/四川话.jpg",
    icon: "/images/icon4.png",
    content: "四川话的词汇主要由承自中上古时期巴蜀语的词汇、由明清时期的湖广填四川的移民带来的移民语言的词汇、承自古代汉语同语的词汇三部分组成。近年来也有大量的来自普通话、英语等语言进入四川话，同时也有诸如“雄起”、“勾兑”、“假打”、“洗白”、“冒泡儿”等四次话新词汇在成都产生，并迅速通行全川。四川话的词汇具有鲜明的地域特色，反映了巴蜀地区独特的民间文化和风俗习惯。由于网络的迅速兴起，所以一些特色四川话也在网上十分流行，例如：“劳资蜀道山”，其实是“老子数到三”的空耳。这句话我其实听的挺多的，每次都是我妈非常愤怒的时候喊出来的话，十分具有压迫感，完全不敢对视也不敢接话。一般这句话后面真的还会跟“一！”来进一步增加压迫感，从而达到不战而屈人之兵的效果。"
  }
]

//获取杂闻列表
function getZawenList() {
  let list = [];
  for (var i = 0; i < zawen.length; i++) {
    let obj = {};
    obj.id = zawen[i].id;
    obj.icon = zawen[i].icon;
    obj.title = zawen[i].title;
    list.push(obj);
  }
  return list; //返回新闻列表
}

//获取杂闻内容
function getZawenDetail(id) {
  let msg = {
    code: '404', //没有对应的杂文
    zawen: {}
  };
  for (var i = 0; i < zawen.length; i++) {
    if (id == zawen[i].id) { //匹配新闻id编号
      msg.code = '200'; //成功
      msg.zawen = zawen[i]; //更新当前新闻内容
      break;
    }
  }
  return msg; //返回查找结果
}

// 对外暴露接口
module.exports = {
  getZawenList: getZawenList,
  getZawenDetail: getZawenDetail
}